[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:26:5
   );
   const [sortDirection, setSortDirection] = useLocalStorage(
     "JobsSearch.SortDirection",
-    "ASC",
+    "",
   );
   const [pageSize, setPageSize] = useLocalStorage("JobsSearch.PageSize", "10");
killedBy: AdminJobsPage tests When localStorage is empty, fallback values are used
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "page": 0,
    "pageSize": "10",

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:28:51
     "JobsSearch.SortDirection",
     "ASC",
   );
-  const [pageSize, setPageSize] = useLocalStorage("JobsSearch.PageSize", "10");
+  const [pageSize, setPageSize] = useLocalStorage("", "10");
 
   // test job
killedBy: AdminJobsPage tests When localStorage is empty, fallback values are used
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "JobsSearch.PageSize", "10"
Received
       1: "JobsSearch.SortField", "createdAt"
       2: "JobsSearch.SortDirection", "ASC"
       3: "", "10"

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:28:74
     "JobsSearch.SortDirection",
     "ASC",
   );
-  const [pageSize, setPageSize] = useLocalStorage("JobsSearch.PageSize", "10");
+  const [pageSize, setPageSize] = useLocalStorage("JobsSearch.PageSize", "");
 
   // test job
killedBy: AdminJobsPage tests When localStorage is empty, fallback values are used
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "JobsSearch.PageSize", "10"
Received
       1: "JobsSearch.SortField", "createdAt"
       2: "JobsSearch.SortDirection", "ASC"
       3: "JobsSearch.PageSize", ""

[Killed] ArrowFunction
main/pages/Admin/AdminJobsPage.js:49:42
 
   // purge job
 
-  const objectToAxiosParamsPurgeJobLog = () => ({
-    url: "/api/jobs/all",
-    method: "DELETE",
-  });
+  const objectToAxiosParamsPurgeJobLog = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can purge all jobs in the JobsTable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.js:49:49
 
   // purge job
 
-  const objectToAxiosParamsPurgeJobLog = () => ({
-    url: "/api/jobs/all",
-    method: "DELETE",
-  });
+  const objectToAxiosParamsPurgeJobLog = () => ({});
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can purge all jobs in the JobsTable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
main/pages/Admin/AdminJobsPage.js:66:47
     purgeJobLogMutation.mutate();
   };
 
-  const objectToAxiosParamsUpdateCoursesJob = (data) => ({
-    url: `/api/jobs/launch/updateCourses?quarterYYYYQ=${data.quarter}&subjectArea=${data.subject}&ifStale=${data.ifStale}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCoursesJob = () => undefined;
 
   const objectToAxiosParamsUpdateCoursesByQuarterJob = (data) => ({
killedBy: AdminJobsPage tests user can submit the update course data job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
main/pages/Admin/AdminJobsPage.js:71:56
     method: "POST",
   });
 
-  const objectToAxiosParamsUpdateCoursesByQuarterJob = (data) => ({
-    url: `/api/jobs/launch/updateQuarterCourses?quarterYYYYQ=${data.quarter}&ifStale=${data.ifStale}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCoursesByQuarterJob = () => undefined;
 
   const objectToAxiosParamsUpdateCoursesByQuarterRangeJob = (data) => ({
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:73:13
 
   const objectToAxiosParamsUpdateCoursesByQuarterJob = (data) => ({
     url: `/api/jobs/launch/updateQuarterCourses?quarterYYYYQ=${data.quarter}&ifStale=${data.ifStale}`,
-    method: "POST",
+    method: "",
   });
 
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
main/pages/Admin/AdminJobsPage.js:76:61
     method: "POST",
   });
 
-  const objectToAxiosParamsUpdateCoursesByQuarterRangeJob = (data) => ({
-    url: `/api/jobs/launch/updateCoursesRangeOfQuarters?start_quarterYYYYQ=${data.startQuarter}&end_quarterYYYYQ=${data.endQuarter}&ifStale=${data.ifStale}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCoursesByQuarterRangeJob = () => undefined;
 
   const objectToAxiosParamsUpdateGradeInfoJob = () => ({
killedBy: AdminJobsPage tests user can submit the update course data by quarter range job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.js:76:72
     method: "POST",
   });
 
-  const objectToAxiosParamsUpdateCoursesByQuarterRangeJob = (data) => ({
-    url: `/api/jobs/launch/updateCoursesRangeOfQuarters?start_quarterYYYYQ=${data.startQuarter}&end_quarterYYYYQ=${data.endQuarter}&ifStale=${data.ifStale}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCoursesByQuarterRangeJob = (data) => ({});
 
   const objectToAxiosParamsUpdateGradeInfoJob = () => ({
killedBy: AdminJobsPage tests user can submit the update course data by quarter range job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:77:10
   });
 
   const objectToAxiosParamsUpdateCoursesByQuarterRangeJob = (data) => ({
-    url: `/api/jobs/launch/updateCoursesRangeOfQuarters?start_quarterYYYYQ=${data.startQuarter}&end_quarterYYYYQ=${data.endQuarter}&ifStale=${data.ifStale}`,
+    url: ``,
     method: "POST",
   });
killedBy: AdminJobsPage tests user can submit the update course data by quarter range job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/jobs/launch/updateCoursesRangeOfQuarters?start_quarterYYYYQ=20212&end_quarterYYYYQ=20213&ifStale=true"
Received: ""

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.js:125:48
     updateCoursesByQuarterRangeJobMutation.mutate(data);
   };
 
-  const submitUpdateGradeInfoJob = async () => {
-    updateGradeInfoJobMutation.mutate();
-  };
+  const submitUpdateGradeInfoJob = async () => {};
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit update grade info
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
