[Survived] ArrayDeclaration
main/components/BasicCourseSearch/CourseOverTimeGeneralEducationSearchForm.js:40:19
   );
   // Stryker restore all
 
-  const geAreas = [
-    { geCode: "A1", description: "Area A1: English Reading and Composition" },
-    { geCode: "B1", description: "Area B1: Physical Science" },
-    { geCode: "C1", description: "Area C1: Arts" },
-    // Add more GE areas as needed
-  ];
+  const geAreas = [];
 
   const handleSubmit = (event) => {

[Survived] ObjectLiteral
main/components/BasicCourseSearch/CourseOverTimeGeneralEducationSearchForm.js:43:5
   const geAreas = [
     { geCode: "A1", description: "Area A1: English Reading and Composition" },
     { geCode: "B1", description: "Area B1: Physical Science" },
-    { geCode: "C1", description: "Area C1: Arts" },
+    {},
     // Add more GE areas as needed
   ];

[Survived] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeGeneralEducationSearchForm.js:47:35
     // Add more GE areas as needed
   ];
 
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    fetchJSON(event, {
-      startQuarter,
-      endQuarter,
-      generalEducation: selectedGEArea,
-    });
-  };
+  const handleSubmit = (event) => {};
 
   //   const testid = "CourseOverTimeGeneralEducationSearchForm";

[Survived] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeGeneralEducationSearchForm.js:67:26
               quarters={quarters}
               quarter={startQuarter}
               setQuarter={setStartQuarter}
-              controlId={"CourseOverTimeGeneralEducationSearch.StartQuarter"}
+              controlId={""}
               label={"Start Quarter"}
             />

[Survived] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeGeneralEducationSearchForm.js:68:22
               quarter={startQuarter}
               setQuarter={setStartQuarter}
               controlId={"CourseOverTimeGeneralEducationSearch.StartQuarter"}
-              label={"Start Quarter"}
+              label={""}
             />
           </Col>

[Survived] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeGeneralEducationSearchForm.js:76:26
               quarters={quarters}
               quarter={endQuarter}
               setQuarter={setEndQuarter}
-              controlId={"CourseOverTimeGeneralEducationSearch.EndQuarter"}
+              controlId={""}
               label={"End Quarter"}
             />

[Survived] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeGeneralEducationSearchForm.js:83:20
         </Row>
         <Form.Group controlId="CourseOverTimeGeneralEducationSearch.GEArea">
           <SingleGEDropdown
-            areas={geAreas || []}
+            areas={geAreas && []}
             area={selectedGEArea}
             setArea={setSelectedGEArea}

[Survived] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeGeneralEducationSearchForm.js:83:20
         </Row>
         <Form.Group controlId="CourseOverTimeGeneralEducationSearch.GEArea">
           <SingleGEDropdown
-            areas={geAreas || []}
+            areas={false}
             area={selectedGEArea}
             setArea={setSelectedGEArea}

[Survived] ObjectLiteral
main/components/BasicCourseSearch/CourseOverTimeGeneralEducationSearchForm.js:90:21
             label="GE Area"
           />
         </Form.Group>
-        <Row style={{ paddingTop: 10, paddingBottom: 10 }}>
+        <Row style={{}}>
           <Col md="auto">
             <Button variant="primary" type="submit">
