[Survived] ArrayDeclaration
main/components/GeneralEducation/SingleGEDropdown.js:9:11
 // doesn't showdown to pre-existing dropdowns
 
 const SingleGEDropdown = ({
-  areas = [],
+  areas = ["Stryker was here"],
   area,
   setArea,

[Survived] StringLiteral
main/components/GeneralEducation/SingleGEDropdown.js:14:11
   setArea,
   controlId,
   onChange = null,
-  label = "GE Area",
+  label = "",
   showAll = false,
 }) => {

[Survived] BooleanLiteral
main/components/GeneralEducation/SingleGEDropdown.js:15:13
   controlId,
   onChange = null,
   label = "GE Area",
-  showAll = false,
+  showAll = true,
 }) => {
   const localSearchArea = localStorage.getItem(controlId);

[Survived] BlockStatement
main/components/GeneralEducation/SingleGEDropdown.js:24:41
     localSearchArea || area,
   );
 
-  const handleAreaOnChange = (event) => {
-    localStorage.setItem(controlId, event.target.value);
-    setAreaState(event.target.value);
-    setArea(event.target.value);
-    if (onChange != null) {
-      onChange(event);
-    }
-  };
+  const handleAreaOnChange = (event) => {};
 
   areas = areas || [];

[Survived] LogicalOperator
main/components/GeneralEducation/SingleGEDropdown.js:33:11
     }
   };
 
-  areas = areas || [];
+  areas = areas && [];
 
   areas.sort(compareValues("geCode"));

[Survived] ConditionalExpression
main/components/GeneralEducation/SingleGEDropdown.js:33:11
     }
   };
 
-  areas = areas || [];
+  areas = true;
 
   areas.sort(compareValues("geCode"));

[Survived] MethodExpression
main/components/GeneralEducation/SingleGEDropdown.js:35:3
 
   areas = areas || [];
 
-  areas.sort(compareValues("geCode"));
+  areas;
 
   return (

[Survived] ConditionalExpression
main/components/GeneralEducation/SingleGEDropdown.js:41:10
     <Form.Group controlId={controlId}>
       <Form.Label>{label}</Form.Label>
       <Form.Control as="select" value={AreaState} onChange={handleAreaOnChange}>
-        {showAll && (
-          <option data-testid={`${controlId}-option-all`} value="ALL">
-            ALL
-          </option>
-        )}
+        {true}
         {areas.map(function (object) {
           const areaCode = object.areaCode

[Survived] ConditionalExpression
main/components/GeneralEducation/SingleGEDropdown.js:41:10
     <Form.Group controlId={controlId}>
       <Form.Label>{label}</Form.Label>
       <Form.Control as="select" value={AreaState} onChange={handleAreaOnChange}>
-        {showAll && (
-          <option data-testid={`${controlId}-option-all`} value="ALL">
-            ALL
-          </option>
-        )}
+        {false}
         {areas.map(function (object) {
           const areaCode = object.areaCode

[Survived] BlockStatement
main/components/GeneralEducation/SingleGEDropdown.js:46:38
             ALL
           </option>
         )}
-        {areas.map(function (object) {
-          const areaCode = object.areaCode
-            ? object.areaCode.replace(/ /g, "-")
-            : object.geCode;
-          const key = `${controlId}-option-${areaCode}`;
-          return (
-            <option key={key} data-testid={key} value={object.geCode}>
-              {object.geCode}
-            </option>
-          );
-        })}
+        {areas.map(function (object) {})}
       </Form.Control>
     </Form.Group>

[Survived] StringLiteral
main/components/GeneralEducation/SingleGEDropdown.js:50:23
           const areaCode = object.areaCode
             ? object.areaCode.replace(/ /g, "-")
             : object.geCode;
-          const key = `${controlId}-option-${areaCode}`;
+          const key = ``;
           return (
             <option key={key} data-testid={key} value={object.geCode}>
