[Survived] ArrowFunction
main/pages/CourseOverTime/CourseOverTimegeneraleducationIndexPage.js:11:31
   // Stryker disable next-line all : Can't test state because hook is internal
   const [setCourseJSON] = useState([]);
 
-  const objectToAxiosParams = (query) => ({
-    url: "/api/public/courseovertime/generalEducationsearch",
-    params: {
-      startQtr: query.startQuarter,
-      endQtr: query.endQuarter,
-      generalEducation: query.generalEducation,
-      lectureOnly: query.checkbox,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (courses) => {

[Survived] StringLiteral
main/pages/CourseOverTime/CourseOverTimegeneraleducationIndexPage.js:12:10
   const [setCourseJSON] = useState([]);
 
   const objectToAxiosParams = (query) => ({
-    url: "/api/public/courseovertime/generalEducationsearch",
+    url: "",
     params: {
       startQtr: query.startQuarter,

[Survived] BlockStatement
main/pages/CourseOverTime/CourseOverTimegeneraleducationIndexPage.js:21:34
     },
   });
 
-  const onSuccess = (courses) => {
-    setCourseJSON(courses);
-  };
+  const onSuccess = (courses) => {};
 
   const mutation = useBackendMutation(

[Survived] BlockStatement
main/pages/CourseOverTime/CourseOverTimegeneraleducationIndexPage.js:32:57
     [],
   );
 
-  async function fetchCourseOverTimeJSON(_event, query) {
-    mutation.mutate(query);
-  }
+  async function fetchCourseOverTimeJSON(_event, query) {}
 
   return (
