[Survived] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeGeneralEducationSearchForm.js:40:35
   const [checkbox, setCheckbox] = useState(localStorageCheckbox || false);
   // Stryker restore all
 
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    fetchJSON(event, { startQuarter, endQuarter, instructor, checkbox });
-  };
+  const handleSubmit = (event) => {};
 
   const handleInstructorOnChange = (event) => {

[Survived] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeGeneralEducationSearchForm.js:45:47
     fetchJSON(event, { startQuarter, endQuarter, instructor, checkbox });
   };
 
-  const handleInstructorOnChange = (event) => {
-    setInstructor(event.target.value);
-  };
+  const handleInstructorOnChange = (event) => {};
 
   const handleCheckboxOnChange = (event) => {

[Survived] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeGeneralEducationSearchForm.js:49:45
     setInstructor(event.target.value);
   };
 
-  const handleCheckboxOnChange = (event) => {
-    setCheckbox(event.target.checked);
-    localStorage.setItem(
-      "CourseOverTimeInstructorSearch.Checkbox",
-      event.target.checked.toString(),
-    );
-  };
+  const handleCheckboxOnChange = (event) => {};
 
   const testid = "CourseOverTimeInstructorSearchForm";

[Survived] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeGeneralEducationSearchForm.js:52:7
   const handleCheckboxOnChange = (event) => {
     setCheckbox(event.target.checked);
     localStorage.setItem(
-      "CourseOverTimeInstructorSearch.Checkbox",
+      "",
       event.target.checked.toString(),
     );

[Survived] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeGeneralEducationSearchForm.js:68:26
               quarters={quarters}
               quarter={startQuarter}
               setQuarter={setStartQuarter}
-              controlId={"CourseOverTimeInstructorSearch.StartQuarter"}
+              controlId={""}
               label={"Start Quarter"}
             />

[Survived] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeGeneralEducationSearchForm.js:69:22
               quarter={startQuarter}
               setQuarter={setStartQuarter}
               controlId={"CourseOverTimeInstructorSearch.StartQuarter"}
-              label={"Start Quarter"}
+              label={""}
             />
           </Col>
