[Survived] BlockStatement
main/components/GeneralEducation/SingleGEDropdown.js:48:38
             ALL
           </option>
         )}
-        {areas.map(function (object) {
-          const areaCode = object.areaCode.replace(/ /g, "-");
-          const key = `${controlId}-option-${areaCode}`;
-          return (
-            <option key={key} data-testid={key} value={object.geCode}>
-              {object.geCode} 
-            </option>
-          );
-        })}
+        {areas.map(function (object) {})}
       </Form.Control>
     </Form.Group>

[Survived] StringLiteral
main/components/GeneralEducation/SingleGEDropdown.js:49:58
           </option>
         )}
         {areas.map(function (object) {
-          const areaCode = object.areaCode.replace(/ /g, "-");
+          const areaCode = object.areaCode.replace(/ /g, "");
           const key = `${controlId}-option-${areaCode}`;
           return (

[Survived] StringLiteral
main/components/GeneralEducation/SingleGEDropdown.js:50:23
         )}
         {areas.map(function (object) {
           const areaCode = object.areaCode.replace(/ /g, "-");
-          const key = `${controlId}-option-${areaCode}`;
+          const key = ``;
           return (
             <option key={key} data-testid={key} value={object.geCode}>
