[Survived] MethodExpression
main/pages/CourseOverTime/CourseOverTimegeneraleducationIndexPage.js:44:21
           fetchJSON={fetchCourseOverTimeJSON}
         />
         <SectionsInstructorTable
-          sections={courseJSON.sort((a, b) =>
-            b.courseInfo.quarter.localeCompare(a.courseInfo.quarter),
-          )}
+          sections={courseJSON}
         />
       </div>

[Survived] ArrowFunction
main/pages/CourseOverTime/CourseOverTimegeneraleducationIndexPage.js:44:37
           fetchJSON={fetchCourseOverTimeJSON}
         />
         <SectionsInstructorTable
-          sections={courseJSON.sort((a, b) =>
-            b.courseInfo.quarter.localeCompare(a.courseInfo.quarter),
+          sections={courseJSON.sort(() => undefined,
           )}
         />
