[Survived] ArrayDeclaration
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.js:11:66
 export default function CourseOverTimeBuildingsIndexPage() {
   // Stryker disable next-line all : Can't test state because hook is internal
   const [courseJSON, setCourseJSON] = useState([]);
-  const [availableClassrooms, setAvailableClassrooms] = useState([]);
+  const [availableClassrooms, setAvailableClassrooms] = useState(["Stryker was here"]);
   const [latestQuery, setLatestQuery] = useState({
     startQuarter: "",

[Survived] StringLiteral
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.js:14:17
   const [availableClassrooms, setAvailableClassrooms] = useState([]);
   const [latestQuery, setLatestQuery] = useState({
     startQuarter: "",
-    endQuarter: "",
+    endQuarter: "Stryker was here!",
     buildingCode: "",
   });

[Killed] ArrowFunction
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.js:18:31
     buildingCode: "",
   });
 
-  const objectToAxiosParams = (q) => ({
-    url: "/api/public/courseovertime/buildingsearch",
-    params: {
-      startQtr: q.startQuarter,
-      endQtr: q.endQuarter,
-      buildingCode: q.buildingCode,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
   const onSuccess = (buildings) => setCourseJSON(buildings);
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, []);
killedBy: CourseOverTimeBuildingsIndexPage tests calls both APIs and passes availableClassrooms to form
statusReason: TypeError: Cannot read properties of undefined (reading 'includes')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.js:26:21
       buildingCode: q.buildingCode,
     },
   });
-  const onSuccess = (buildings) => setCourseJSON(buildings);
+  const onSuccess = () => undefined;
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, []);
 
killedBy: CourseOverTimeBuildingsIndexPage tests calls both APIs and passes availableClassrooms to form
statusReason: TestingLibraryElementError: Unable to find an element with the text: CHEM 184. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.js:27:60
     },
   });
   const onSuccess = (buildings) => setCourseJSON(buildings);
-  const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, []);
+  const mutation = useBackendMutation(objectToAxiosParams, {}, []);
 
   const objectToAxiosParamsClassrooms = (q) => ({
killedBy: CourseOverTimeBuildingsIndexPage tests calls both APIs and passes availableClassrooms to form
statusReason: TestingLibraryElementError: Unable to find an element with the text: CHEM 184. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.js:29:41
   const onSuccess = (buildings) => setCourseJSON(buildings);
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, []);
 
-  const objectToAxiosParamsClassrooms = (q) => ({
-    url: "/api/public/courseovertime/classrooms",
-    params: {
-      startQtr: q.startQuarter,
-      endQtr: q.endQuarter,
-      buildingCode: q.buildingCode,
-    },
-  });
+  const objectToAxiosParamsClassrooms = () => undefined;
   const classroomMutation = useBackendMutation(
     objectToAxiosParamsClassrooms,
killedBy: CourseOverTimeBuildingsIndexPage tests calls both APIs and passes availableClassrooms to form
statusReason: TypeError: Cannot read properties of undefined (reading 'includes')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.js:39:18
   });
   const classroomMutation = useBackendMutation(
     objectToAxiosParamsClassrooms,
-    { onSuccess: (rooms) => setAvailableClassrooms(rooms) },
+    { onSuccess: () => undefined },
     [],
   );
killedBy: CourseOverTimeBuildingsIndexPage tests calls both APIs and passes availableClassrooms to form
statusReason: Error: expect(jest.fn()).toHaveBeenLastCalledWith(...expected)

Expected: ObjectContaining {"availableClassrooms": ["1004", "2110"]}
Received
       3: {"availableClassrooms": [], "fetchJSON": [Function fetchCourseOverTimeJSON]}
->     4: {"availableClassrooms": [], "fetchJSON": [Function fetchCourseOverTimeJSON]}

Number of calls: 4

[Killed] ObjectLiteral
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.js:39:5
   });
   const classroomMutation = useBackendMutation(
     objectToAxiosParamsClassrooms,
-    { onSuccess: (rooms) => setAvailableClassrooms(rooms) },
+    {},
     [],
   );
killedBy: CourseOverTimeBuildingsIndexPage tests calls both APIs and passes availableClassrooms to form
statusReason: Error: expect(jest.fn()).toHaveBeenLastCalledWith(...expected)

Expected: ObjectContaining {"availableClassrooms": ["1004", "2110"]}
Received
       3: {"availableClassrooms": [], "fetchJSON": [Function fetchCourseOverTimeJSON]}
->     4: {"availableClassrooms": [], "fetchJSON": [Function fetchCourseOverTimeJSON]}

Number of calls: 4

[Killed] BlockStatement
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.js:46:19
   const { startQuarter, endQuarter, buildingCode } = latestQuery;
   const fetchClassrooms = classroomMutation.mutate;
 
-  useEffect(() => {
-    if (!buildingCode) {
-      setAvailableClassrooms([]);
-      return;
-    }
-    fetchClassrooms({ startQuarter, endQuarter, buildingCode });
-  }, [startQuarter, endQuarter, buildingCode, fetchClassrooms]);
+  useEffect(() => {}, [startQuarter, endQuarter, buildingCode, fetchClassrooms]);
 
   function fetchCourseOverTimeJSON(_e, query) {
killedBy: CourseOverTimeBuildingsIndexPage tests calls both APIs and passes availableClassrooms to form
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  ["/api/public/courseovertime/buildingsearch"]

Ignored nodes: comments, script, style
<html>

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.js:47:9
   const fetchClassrooms = classroomMutation.mutate;
 
   useEffect(() => {
-    if (!buildingCode) {
+    if (false) {
       setAvailableClassrooms([]);
       return;
killedBy: CourseOverTimeBuildingsIndexPage tests calls both APIs and passes availableClassrooms to form
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3
Received array:  ["/api/public/courseovertime/classrooms", "/api/public/courseovertime/buildingsearch", "/api/public/courseovertime/classrooms"]

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.js:47:24
   const fetchClassrooms = classroomMutation.mutate;
 
   useEffect(() => {
-    if (!buildingCode) {
-      setAvailableClassrooms([]);
-      return;
-    }
+    if (!buildingCode) {}
     fetchClassrooms({ startQuarter, endQuarter, buildingCode });
   }, [startQuarter, endQuarter, buildingCode, fetchClassrooms]);
killedBy: CourseOverTimeBuildingsIndexPage tests calls both APIs and passes availableClassrooms to form
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3
Received array:  ["/api/public/courseovertime/classrooms", "/api/public/courseovertime/buildingsearch", "/api/public/courseovertime/classrooms"]

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.js:54:47
     fetchClassrooms({ startQuarter, endQuarter, buildingCode });
   }, [startQuarter, endQuarter, buildingCode, fetchClassrooms]);
 
-  function fetchCourseOverTimeJSON(_e, query) {
-    mutation.mutate(query);
-    setLatestQuery(query);
-  }
+  function fetchCourseOverTimeJSON(_e, query) {}
 
   return (
killedBy: CourseOverTimeBuildingsIndexPage tests calls both APIs and passes availableClassrooms to form
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

Ignored nodes: comments, script, style
<html>
