[Killed] StringLiteral
main/components/Classrooms/SingleClassroomDropdown.js:12:11
   setClassroom,
   controlId,
   onChange = null,
-  label = "Classroom",
+  label = "",
   showAll = false,
 }) => {
killedBy: SingleClassroomDropdown behavior tests invokes callbacks when selection changes
statusReason: TestingLibraryElementError: Unable to find a label with the text of: Classroom

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] BooleanLiteral
main/components/Classrooms/SingleClassroomDropdown.js:13:13
   controlId,
   onChange = null,
   label = "Classroom",
-  showAll = false,
+  showAll = true,
 }) => {
   const [value, setValue] = useState(
killedBy: SingleClassroomDropdown behavior tests renders no classrooms if input list is empty
statusReason: Error: expect(received).toBeNull()

Received: <option data-testid="cd1-option-all" value="ALL">ALL</option>

[Killed] BooleanLiteral
main/components/Classrooms/SingleClassroomDropdown.js:20:29
     localStorage.getItem(controlId) || classroom || "",
   );
 
-  const isFirstRun = useRef(true);
+  const isFirstRun = useRef(false);
 
   useEffect(() => {
killedBy: SingleClassroomDropdown behavior tests uses prop value if no localStorage key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1502"
Received: "1401"

[Killed] BlockStatement
main/components/Classrooms/SingleClassroomDropdown.js:22:19
 
   const isFirstRun = useRef(true);
 
-  useEffect(() => {
-    if (isFirstRun.current) {
-      isFirstRun.current = false;
-      return;
-    }
-    localStorage.removeItem(controlId);
-    // Stryker disable next-line all : not sure how to test/mock local storage
-    setValue("");
-    setClassroom("");
-  }, [
+  useEffect(() => {}, [
     building, // reset when building changes
     controlId, // used inside effect
killedBy: SingleClassroomDropdown behavior tests clears value when building input is changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ""
Received: "1502"

Number of calls: 1

[Killed] ConditionalExpression
main/components/Classrooms/SingleClassroomDropdown.js:23:9
   const isFirstRun = useRef(true);
 
   useEffect(() => {
-    if (isFirstRun.current) {
+    if (false) {
       isFirstRun.current = false;
       return;
killedBy: SingleClassroomDropdown behavior tests uses prop value if no localStorage key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1502"
Received: "1401"

[Killed] BlockStatement
main/components/Classrooms/SingleClassroomDropdown.js:23:29
   const isFirstRun = useRef(true);
 
   useEffect(() => {
-    if (isFirstRun.current) {
-      isFirstRun.current = false;
-      return;
-    }
+    if (isFirstRun.current) {}
     localStorage.removeItem(controlId);
     // Stryker disable next-line all : not sure how to test/mock local storage
killedBy: SingleClassroomDropdown behavior tests uses prop value if no localStorage key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1502"
Received: "1401"

[Killed] BooleanLiteral
main/components/Classrooms/SingleClassroomDropdown.js:24:28
 
   useEffect(() => {
     if (isFirstRun.current) {
-      isFirstRun.current = false;
+      isFirstRun.current = true;
       return;
     }
killedBy: SingleClassroomDropdown behavior tests clears value when building input is changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ""
Received: "1502"

Number of calls: 1

[Killed] ArrayDeclaration
main/components/Classrooms/SingleClassroomDropdown.js:31:6
     // Stryker disable next-line all : not sure how to test/mock local storage
     setValue("");
     setClassroom("");
-  }, [
-    building, // reset when building changes
-    controlId, // used inside effect
-    setClassroom, // used inside effect
-  ]);
+  }, []);
 
   const handleChange = (e) => {
killedBy: SingleClassroomDropdown behavior tests clears value when building input is changed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ""
Received: "1502"

Number of calls: 1

[Killed] BlockStatement
main/components/Classrooms/SingleClassroomDropdown.js:37:31
     setClassroom, // used inside effect
   ]);
 
-  const handleChange = (e) => {
-    const v = e.target.value;
-    localStorage.setItem(controlId, v);
-    setValue(v);
-    setClassroom(v);
-    if (onChange) onChange(e);
-  };
+  const handleChange = (e) => {};
 
   const options = (
killedBy: SingleClassroomDropdown behavior tests invokes callbacks when selection changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "1502"

Number of calls: 0

[Killed] ConditionalExpression
main/components/Classrooms/SingleClassroomDropdown.js:42:9
     localStorage.setItem(controlId, v);
     setValue(v);
     setClassroom(v);
-    if (onChange) onChange(e);
+    if (false) onChange(e);
   };
 
killedBy: SingleClassroomDropdown behavior tests invokes callbacks when selection changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/components/Classrooms/SingleClassroomDropdown.js:42:9
     localStorage.setItem(controlId, v);
     setValue(v);
     setClassroom(v);
-    if (onChange) onChange(e);
+    if (true) onChange(e);
   };
 
killedBy: SingleClassroomDropdown behavior tests clears value when building input is changed
statusReason: TypeError: onChange is not a function

[Killed] MethodExpression
main/components/Classrooms/SingleClassroomDropdown.js:45:19
     if (onChange) onChange(e);
   };
 
-  const options = (
-    showAll ? classrooms : classrooms.filter((c) => c.buildingCode === building)
-  ).sort(compareValues("roomNumber"));
+  const options = showAll ? classrooms : classrooms.filter(c => c.buildingCode === building);
 
   return (
killedBy: SingleClassroomDropdown behavior tests orders classrooms numerically even if unsorted
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   "1603",
    "1401",

[Killed] MethodExpression
main/components/Classrooms/SingleClassroomDropdown.js:46:28
   };
 
   const options = (
-    showAll ? classrooms : classrooms.filter((c) => c.buildingCode === building)
+    showAll ? classrooms : classrooms
   ).sort(compareValues("roomNumber"));
 
killedBy: SingleClassroomDropdown behavior tests clears value when building input is changed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "1401"

[Killed] ConditionalExpression
main/components/Classrooms/SingleClassroomDropdown.js:46:53
   };
 
   const options = (
-    showAll ? classrooms : classrooms.filter((c) => c.buildingCode === building)
+    showAll ? classrooms : classrooms.filter((c) => true)
   ).sort(compareValues("roomNumber"));
 
killedBy: SingleClassroomDropdown behavior tests clears value when building input is changed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "1401"

[Killed] ConditionalExpression
main/components/Classrooms/SingleClassroomDropdown.js:53:10
     <Form.Group controlId={controlId}>
       <Form.Label>{label}</Form.Label>
       <Form.Control as="select" value={value} onChange={handleChange}>
-        {showAll && (
-          <option data-testid={`${controlId}-option-all`} value="ALL">
-            ALL
-          </option>
-        )}
+        {false}
         {options.map((c) => {
           const slug = `${c.roomNumber}`.replace(/ /g, "");
killedBy: SingleClassroomDropdown behavior tests includes 'ALL' option when enabled
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="cd1-option-all"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] LogicalOperator
main/components/Classrooms/SingleClassroomDropdown.js:53:10
     <Form.Group controlId={controlId}>
       <Form.Label>{label}</Form.Label>
       <Form.Control as="select" value={value} onChange={handleChange}>
-        {showAll && (
-          <option data-testid={`${controlId}-option-all`} value="ALL">
-            ALL
-          </option>
-        )}
+        {showAll || <option data-testid={`${controlId}-option-all`} value="ALL">
+            ALL
+          </option>}
         {options.map((c) => {
           const slug = `${c.roomNumber}`.replace(/ /g, "");
killedBy: SingleClassroomDropdown behavior tests includes 'ALL' option when enabled
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="cd1-option-all"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] BlockStatement
main/components/Classrooms/SingleClassroomDropdown.js:58:29
             ALL
           </option>
         )}
-        {options.map((c) => {
-          const slug = `${c.roomNumber}`.replace(/ /g, "");
-          const key = `${controlId}-option-${slug}`;
-          return (
-            <option key={key} data-testid={key} value={c.roomNumber}>
-              {c.roomNumber}
-            </option>
-          );
-        })}
+        {options.map((c) => {})}
       </Form.Control>
     </Form.Group>
killedBy: SingleClassroomDropdown behavior tests displays single classroom correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="cd1-option-1401"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] StringLiteral
main/components/Classrooms/SingleClassroomDropdown.js:59:24
           </option>
         )}
         {options.map((c) => {
-          const slug = `${c.roomNumber}`.replace(/ /g, "");
+          const slug = ``.replace(/ /g, "");
           const key = `${controlId}-option-${slug}`;
           return (
killedBy: SingleClassroomDropdown behavior tests displays single classroom correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="cd1-option-1401"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] StringLiteral
main/components/Classrooms/SingleClassroomDropdown.js:60:23
         )}
         {options.map((c) => {
           const slug = `${c.roomNumber}`.replace(/ /g, "");
-          const key = `${controlId}-option-${slug}`;
+          const key = ``;
           return (
             <option key={key} data-testid={key} value={c.roomNumber}>
killedBy: SingleClassroomDropdown behavior tests displays single classroom correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="cd1-option-1401"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"
