[Killed] ArrowFunction
main/pages/SectionSearches/SectionSearchesIndexPage.js:12:31
   // Stryker disable next-line all : Can't test state because hook is internal
   const [sectionJSON, setSectionJSON] = useState([]);
 
-  const objectToAxiosParams = (query) => ({
-    url: "/api/sections/basicsearch",
-    params: {
-      qtr: query.quarter,
-      dept: query.subject,
-      level: query.level,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (section) => {
killedBy: Section Searches Index Page tests calls UCSB section search api correctly with 1 section response
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"dept": "ANTH", "level": "G", "qtr": "20222"}
Received: undefined

[Killed] BlockStatement
main/pages/SectionSearches/SectionSearchesIndexPage.js:21:34
     },
   });
 
-  const onSuccess = (section) => {
-    setSectionJSON(section);
-  };
+  const onSuccess = (section) => {};
 
   const mutation = useBackendMutation(
killedBy: Section Searches Index Page tests calls UCSB section search api correctly with 1 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/SectionSearches/SectionSearchesIndexPage.js:32:55
     [],
   );
 
-  async function fetchBasicSectionJSON(_event, query) {
-    mutation.mutate(query);
-  }
+  async function fetchBasicSectionJSON(_event, query) {}
   return (
     <BasicLayout>
killedBy: Section Searches Index Page tests calls UCSB section search api correctly with 1 section response
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 1
Received:    0

Ignored nodes: comments, script, style
<html>
  <head />
