[Killed] StringLiteral
main/components/Jobs/JobsSearchForm.js:21:23
     },
     {
       label: "Sort Direction",
-      values: ["ASC", "DESC"],
+      values: ["ASC", ""],
       controlId: "JobsSearch.SortDirection",
       onChange: updateSortDirection,
killedBy: JobsSearchForm renders all dropdown options correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "ASC",
-   "DESC",

[Killed] StringLiteral
main/components/Jobs/JobsSearchForm.js:21:16
     },
     {
       label: "Sort Direction",
-      values: ["ASC", "DESC"],
+      values: ["", "DESC"],
       controlId: "JobsSearch.SortDirection",
       onChange: updateSortDirection,
killedBy: AdminJobsPage tests When localStorage is empty, fallback values are used
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 2

  Object {
    "JobsSearch.PageSize,10": 1,
    "JobsSearch.PageSize,5": 1,

[Killed] ArrayDeclaration
main/components/Jobs/JobsSearchForm.js:27:15
     },
     {
       label: "Page Size",
-      values: ["5", "10", "25", "50", "75", "100"],
+      values: [],
       controlId: "JobsSearch.PageSize",
       onChange: updatePageSize,
killedBy: JobsSearchForm renders all dropdown options correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   "5",
-   "10",

[Killed] StringLiteral
main/components/Jobs/JobsSearchForm.js:27:16
     },
     {
       label: "Page Size",
-      values: ["5", "10", "25", "50", "75", "100"],
+      values: ["", "10", "25", "50", "75", "100"],
       controlId: "JobsSearch.PageSize",
       onChange: updatePageSize,
killedBy: AdminJobsPage tests When localStorage is empty, fallback values are used
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
+   "JobsSearch.PageSize,": 1,
    "JobsSearch.PageSize,10": 1,

[Killed] StringLiteral
main/components/Jobs/JobsSearchForm.js:28:18
     {
       label: "Page Size",
       values: ["5", "10", "25", "50", "75", "100"],
-      controlId: "JobsSearch.PageSize",
+      controlId: "",
       onChange: updatePageSize,
     },
killedBy: JobsSearchForm renders all dropdowns and pagination
statusReason: TestingLibraryElementError: Found a label with the text of: Page Size, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >

[Killed] ArrowFunction
main/components/Jobs/JobsSearchForm.js:33:26
     },
   ];
 
-  const renderDropdown = ({ label, values, controlId, onChange }) => (
-    <Col md="auto" key={controlId}>
-      <GenericDropdown
-        label={label}
-        values={values}
-        controlId={controlId}
-        setValue={onChange}
-      />
-    </Col>
-  );
+  const renderDropdown = () => undefined;
 
   return (
killedBy: JobsSearchForm renders all dropdowns and pagination
statusReason: TestingLibraryElementError: Unable to find a label with the text of: Sort By

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="container"
    >
